backend/artillery/userloadtest.yml
config:
  target: 'https://localhost:8000/user'
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  payload:
    - path: "users.csv"
      fields:
      - "_id"
      - "username"
      - "email"
      - "password"
      - "firstName"
      - "lastName"
      - "birthDate"
      - "reports"
      - "credit"
      - "role"
      - "isDeleted"
      - "cardDetails"
      - "activationDate"
      - "banUntil"
    - path: "newUsers.csv"
      fields:
      - "_id"
      - "newUsername"
      - "newEmail"
      - "newPassword"
      - "newFirstName"
      - "newLastName"
      - "newBirthDate"
      - "newReports"
      - "newCredit"
      - "newRole"
      - "newIsDeleted"
      - "newCardDetails"
      - "newActivationDate"
      - "newBanUntil"
    - path: "newCardDetails.csv"
      fields:
      - "newCardNumber"
      - "newExpiryDate"
      - "newCvv"
      - "newNameOnCard"
      - "newAddressLine1"
      - "newCity"
      - "newCounty"
      - "newPostcode"
      - "newCountry"
scenarios:
- name: "Password Reset"
  flow:
    - post:
        url: "/password-reset"
        json: 
          key: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6InVzZXJAc3RvY2t0cmFkaW5nc3lzdGVtLmNvbSIsInJlcXVlc3REYXRlIjoiU2F0IEp1bCAyMyAyMDIyIDEyOjUxOjAyIEdNVCswMTAwIChCcml0aXNoIFN1bW1lciBUaW1lKSJ9.-Gk6FSneiFdfni_TExzCK-xVpbGIxGSuhf3ekwS0smc"
          password: "{{ password }}"
- name: "Password Reset Request Request"
  flow:
    - post:
        url: "/password-reset-request"
        json: 
          email: "{{ email }}"
- name: "Test error"
  flow:
    - get:
        url: "/test-error"
- name: "Get all users"
  flow:
    - get:
        url: "/all"
        cookie:
          token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJyb2xlIjoiQWRtaW4ifQ.eWPKdazMo3apas2nxUDq2H5Kx3Pw5_PTO-szXmylZ3w"
- name: "Get one user"
  flow:
    - get:
        url: "/one"
        json: 
          username: "{{ username }}"
        cookie:
          token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJyb2xlIjoiQWRtaW4ifQ.eWPKdazMo3apas2nxUDq2H5Kx3Pw5_PTO-szXmylZ3w"
- name: "Sign in user"
  flow:
    - post:
        url: "/signin"
        json: 
          username: "{{ username }}"
          password: "{{ password }}"
        cookie:
          token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJyb2xlIjoiQWRtaW4ifQ.eWPKdazMo3apas2nxUDq2H5Kx3Pw5_PTO-szXmylZ3w"
- name: "Register user"
  flow:
    - post:
        url: "/register"
        json: 
          username: "{{ username }}"
          email: "{{ email }}"
          firstName: "{{ firstName }}"
          lastName: "{{ lastName }}"
          birthDate: "{{ birthDate }}"
          password: "{{ password }}"
- name: "Add new credit card"
  flow:
    - post:
        url: "/credit-card"
        json: 
          cardNumber: "{{ newCardNumber }}"
          expiryDate: "{{ newExpiryDate }}"
          cvv: "{{ newCvv }}"
          nameOnCard: "{{ newNameOnCard }}"
          addressLine1: "{{ newAddressLine1 }}"
          city: "{{ newCity }}"
          county: "{{ newCounty }}"
          postcode: "{{ newPostcode }}"
          country: "{{ newCountry }}"
- name: "Validate user token"
  flow:
    - get:
        url: "/signin"
        json: 
          username: "{{ username }}"
          password: "{{ password }}"
    - post:
        url: "/validate"
- name: "Edit user details"
  flow:
    - get:
        url: "/signin"
        json: 
          username: "{{ username }}"
          password: "{{ password }}"
    - post:
        url: "/edit"
        json: 
          username: "{{ username }}"
          firstName: "testchangedname"
- name: "Sign out user"
  flow:
    - get:
        url: "/signin"
        json: 
          username: "{{ username }}"
          password: "{{ password }}"
    - post:
        url: "/signout"
- name: "Activate user"
  flow:
    - post:
        url: "/activate"
        json: 
          username: "{{ username }}"
          password: "{{ password }}"
- name: "Request deactivation"
  flow:
    - post:
        url: "/requestdeactivation"
        json: 
          username: "{{ username }}"
          password: "{{ password }}"