backend/artillery/userloadtest.yml
config:
  target: 'https://localhost:8000/user'
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "users.csv"
    fields:
      - "_id"
      - "username"
      - "email"
      - "password"
      - "firstName"
      - "lastName"
      - "birthDate"
      - "reports"
      - "credit"
      - "role"
      - "isDeleted"
      - "cardDetails"
      - "activationDate"
      - "banUntil"
  
scenarios:
- name: "Password Reset"
  flow:
    - get:
        url: "/password-reset"
        json: 
          key: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImFkbWluQHN0b2NrdHJhZGluZ3N5c3RlbS5jb20iLCJwYXNzd29yZCI6IlBhc3N3b3JkMSEifQ.ZIX_2eC_1GV2iTkgC3MbrW2OpBjh23RnawLW0pfj1GE"
          password: "Password1!2"
- name: "Test error"
  flow:
    - get:
        url: "/test-error"